---
kind: method
id: M:Autodesk.Revit.DB.Lighting.InitialIntensity.Clone
source: html/34b4a3d4-c70d-0c9f-6b76-d63940fe3e37.htm
---
# Autodesk.Revit.DB.Lighting.InitialIntensity.Clone Method

Creates a copy of the InitialIntensity derived object.

## Syntax (C#)
```csharp
public InitialIntensity Clone()
```